Catalogs/тсВидыПечатныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>тсВидыПечатныхДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СклеиватьВОдинФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьПослеФормирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОднаИсходящаяКорреспонденция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШаблоныПечатныхФорм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШаблонПечатнойФормы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.тсШаблоныПечатныхДокументов</v8:Type>
								<v8:Type>cfg:CatalogRef.КомплектыФайловДляПечати</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцияСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцияКоличество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийНомер</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прикреплять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыЭлДок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыЭлДок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Word</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OpenOffice</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Универсальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/тсВидыПечатныхДокументов/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если УниверсальныйТипИспользуетсяВместеСДругимиТипамиШаблонов() Тогда
	
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Универсальный шаблон не может использоваться с другими типами шаблонов!";
		Сообщение.Сообщить();
	
	КонецЕсли;
	
КонецПроцедуры

#Область ВспомогательнаяПроверкаЗаполнения

Функция УниверсальныйТипИспользуетсяВместеСДругимиТипамиШаблонов()

	Шаблоны = ПолучитьТекущиеШаблоны();
	
	ПроверочнаяПеременная = Неопределено;
	Если Шаблоны.Количество() > 0 Тогда
	
		ПроверочнаяПеременная = ЭтоУниверсальныйШаблон(Шаблоны[0].ТипДокумента);
	
	КонецЕсли;
	
	Для каждого Шаблон Из Шаблоны Цикл
	
		Если ПроверочнаяПеременная <> ЭтоУниверсальныйШаблон(Шаблон.ТипДокумента) Тогда
		
			Возврат Истина;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции // ()

Функция ЭтоУниверсальныйШаблон(ТипДокумента)

	Если ТипДокумента = Перечисления.ТипыЭлДок.Универсальный Тогда
	
		Возврат Истина;
	
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции // ()


Функция ПолучитьТекущиеШаблоны()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тсВидыПечатныхДокументовШаблоныПечатныхФорм.ШаблонПечатнойФормы КАК Шаблон
		|ПОМЕСТИТЬ втШаблоныПечатныхФорм
		|ИЗ
		|	&ШаблоныПечатныхФорм КАК тсВидыПечатныхДокументовШаблоныПечатныхФорм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тсВидыПечатныхДокументовШаблоныПечатныхФорм.Шаблон КАК Справочник.тсШаблоныПечатныхДокументов) КАК Шаблон,
		|	тсВидыПечатныхДокументовШаблоныПечатныхФорм.Шаблон.ТипДокумента КАК ТипДокумента
		|ИЗ
		|	втШаблоныПечатныхФорм КАК тсВидыПечатныхДокументовШаблоныПечатныхФорм
		|ГДЕ
		|	тсВидыПечатныхДокументовШаблоныПечатныхФорм.Шаблон ССЫЛКА Справочник.тсШаблоныПечатныхДокументов";
	
	Шаблоны = ЭтотОбъект.ШаблоныПечатныхФорм.Выгрузить();
	Запрос.УстановитьПараметр("ШаблоныПечатныхФорм", Шаблоны);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Возврат ВыборкаДетальныеЗаписи;

КонецФункции


#КонецОбласти
